cmd/gsl-diagram/testdata/sequence-diagrams/003-activations/output.puml
@startuml

participant A
participant B
participant C

A->B ++: Activated
    B->C
return

A->B ++
return

A->B ++: Activation 3
    B->C
return

A->B ++: Deep
    B->C ++: Deeper
        C->A
    return
return

A->B ++: Self
    B->B
return

A->B ++: Multi
    B->C
    C->A
return

A->C ++
    C->B
    A->B ++
        B->C
        C->B
    return
    C->B
return

@enduml
